       identification division.
       program-id. CBLPGPCT.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program CBLPGPCT.